project-catalogue.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: Project Catalogue
#+DATE: <2017-04-05 Wed>
#+AUTHOR: Edward John Steere
#+EMAIL: edward.steere@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.0.50.1 (Org mode 9.0.5)
#+STARTUP: showall
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="bootstrap.css" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="base.css" />
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.0.50 (<a href="http://orgmode.org">Org</a> mode 9.0.5)
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div

* Introduction
This is a literate program which demonstrates the power of using
Emacs, org-mode and Emacs Lisp to create a Clojure microservice.

** Project Local Setup
This section specifies some tools which are useful to use with this
project.

The first of which is tangling and executing the current block so that
you don't have to tangle the whole darn project each time.  All credit
for local key bindings goes to phils from this [[http://stackoverflow.com/questions/21486934/file-specific-key-binding-in-emacs][Stack Overflow article]].
Evaluate this block and then you'll be able to use =C-c C-v C-t= with
the point in any block and update the REPLs current definitions from
that block.

#+BEGIN_SRC emacs-lisp :results none
  (defun my-buffer-local-set-key (key command)
    "Bind KEY to COMMAND in this buffer."
    (let ((oldmap (current-local-map))
          (newmap (make-sparse-keymap)))
      (when oldmap
        (set-keymap-parent newmap oldmap))
      (define-key newmap key command)
      (use-local-map newmap)))

  (defun quiescent-tangle-and-load-current-block (point)
    "Tangle and load the block at POINT into the current clojure session."
    (interactive "d")
    (let ((code (nth 5 (org-babel-tangle-single-block 0))))
      (message (format "%s"
                       (nrepl-sync-request:eval
                        code (cider-current-connection) "project-catalog.service")))))

  (my-buffer-local-set-key (kbd "C-c C-v C-t") #'quiescent-tangle-and-load-current-block)
#+END_SRC

** Start NREPL
This step requires that you have cider installed as well as Clojure
mode.  It'll just run the same =jack-in= command as you usually would
when you're editing a file.  Run this block before continuing.

#+BEGIN_SRC emacs-lisp :results none
  (call-interactively 'cider-jack-in)
#+END_SRC

** Start the Service
This block will start your web service.  We run it with an optional
flag which makes it run asynchronously so that you can continue
sending commands to the REPL while it's going.

#+BEGIN_SRC emacs-lisp :output none
  (call-interactively #'org-babel-tangle)

  (cider-load-file "src/service.clj")

  (sit-for 10)

  (nrepl-sync-request:eval "(project-catalog.service/run-dev)"
                           (cider-current-connection)
                           (cider-current-ns))
#+END_SRC

** Tangle and Eval All
This serves as a convenience to reload everything in the project by
first tangling and then updating the environment.

#+BEGIN_SRC emacs-lisp :results none
  (call-interactively #'org-babel-tangle)

  (mapc (lambda (file)
          (cider-load-file file))
        (directory-files "src/" t ".*\.clj$" t))
#+END_SRC

* Defining the Microservice
The micro service has been broken down into components which appear in
the order of greatest interest first.  The service itself is simply
the composition of these components as follows:

#+BEGIN_SRC clojure :noweb tangle :results none :tangle src/service.clj
  (ns project-catalog.service)

  <<server>>
#+END_SRC

