project-catalogue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-09 Tue 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Catalogue</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Edward John Steere" />
<link rel="stylesheet" type="text/css" href="bootstrap.css" />
<link rel="stylesheet" type="text/css" href="base.css" />
</head>
<body>
<div id="content">
<h1 class="title">Project Catalogue</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga206cd8">1. Introduction</a>
<ul>
<li><a href="#org731192c">1.1. Project Local Setup</a></li>
<li><a href="#orgc8f0b2d">1.2. Start NREPL</a></li>
<li><a href="#org9a7eb3d">1.3. Start the Service</a></li>
<li><a href="#orged246c5">1.4. Tangle and Eval All</a></li>
</ul>
</li>
<li><a href="#orgcffc676">2. Defining the Microservice</a>
<ul>
<li><a href="#orgd9a31df">2.1. Routes</a></li>
<li><a href="#org172018a">2.2. Getting Projects from Github</a></li>
<li><a href="#org99520d9">2.3. Services</a></li>
<li><a href="#org544fd46">2.4. Database Queries</a></li>
<li><a href="#orgbd9bead">2.5. Pedestal Service Definition</a></li>
<li><a href="#orgf7257b8">2.6. Web Server</a></li>
<li><a href="#orgfe3095b">2.7. Keeping It Safe</a></li>
<li><a href="#orgaa310ca">2.8. Post to a Token Service</a></li>
<li><a href="#org2b51390">2.9. Handling XML</a></li>
</ul>
</li>
<li><a href="#org0a6868c">3. Testing the Service</a>
<ul>
<li><a href="#orga4261d3">3.1. Get Projects</a></li>
<li><a href="#orgb7fa859">3.2. Get a Project By Name</a></li>
<li><a href="#org4c60880">3.3. Creating a Project</a></li>
<li><a href="#orgea4ee6f">3.4. Searching Github</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga206cd8" class="outline-2">
<h2 id="orga206cd8"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a literate program which demonstrates the power of using
Emacs, org-mode and Emacs Lisp to create a Clojure microservice.
</p>
</div>

<div id="outline-container-org731192c" class="outline-3">
<h3 id="org731192c"><span class="section-number-3">1.1</span> Project Local Setup</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This section specifies some tools which are useful to use with this
project.
</p>

<p>
The first of which is tangling and executing the current block so that
you don't have to tangle the whole darn project each time.  All credit
for local key bindings goes to phils from this <a href="http://stackoverflow.com/questions/21486934/file-specific-key-binding-in-emacs">Stack Overflow article</a>.
Evaluate this block and then you'll be able to use <code>C-c C-v C-t</code> with
the point in any block and update the REPLs current definitions from
that block.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defun</span> <span style="color: #61afef;">my-buffer-local-set-key</span> <span style="color: #93a8c6;">(</span>key command<span style="color: #93a8c6;">)</span>
  <span style="color: #9eac8c;">"Bind KEY to COMMAND in this buffer."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>oldmap <span style="color: #aebed8;">(</span>current-local-map<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        <span style="color: #97b098;">(</span>newmap <span style="color: #aebed8;">(</span>make-sparse-keymap<span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #c678dd; font-weight: bold;">when</span> oldmap
      <span style="color: #97b098;">(</span>set-keymap-parent newmap oldmap<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>define-key newmap key command<span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>use-local-map newmap<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defun</span> <span style="color: #61afef;">quiescent-tangle-and-load-current-block</span> <span style="color: #93a8c6;">(</span>point<span style="color: #93a8c6;">)</span>
  <span style="color: #9eac8c;">"Tangle and load the block at POINT into the current clojure session."</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">interactive</span> <span style="color: #98be65;">"d"</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>code <span style="color: #aebed8;">(</span>nth 5 <span style="color: #b0b0b3;">(</span>org-babel-tangle-single-block 0<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #b0b1a3;">(</span>message <span style="color: #97b098;">(</span>format <span style="color: #98be65;">"%s"</span>
                     <span style="color: #aebed8;">(</span>nrepl-sync-request:eval
                      code <span style="color: #b0b0b3;">(</span>cider-current-connection<span style="color: #b0b0b3;">)</span> <span style="color: #98be65;">"project-catalog.service"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>my-buffer-local-set-key <span style="color: #93a8c6;">(</span>kbd <span style="color: #98be65;">"C-c C-v C-t"</span><span style="color: #93a8c6;">)</span> #'quiescent-tangle-and-load-current-block<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8f0b2d" class="outline-3">
<h3 id="orgc8f0b2d"><span class="section-number-3">1.2</span> Start NREPL</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This step requires that you have cider installed as well as Clojure
mode.  It'll just run the same <code>jack-in</code> command as you usually would
when you're editing a file.  Run this block before continuing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>call-interactively 'cider-jack-in<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a7eb3d" class="outline-3">
<h3 id="org9a7eb3d"><span class="section-number-3">1.3</span> Start the Service</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This block will start your web service.  We run it with an optional
flag which makes it run asynchronously so that you can continue
sending commands to the REPL while it's going.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>call-interactively #'org-babel-tangle<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>cider-load-file <span style="color: #98be65;">"src/service.clj"</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>nrepl-sync-request:eval <span style="color: #98be65;">"(project-catalog.service/run-dev)"</span>
                         <span style="color: #93a8c6;">(</span>cider-current-connection<span style="color: #93a8c6;">)</span>
                         <span style="color: #93a8c6;">(</span>cider-current-ns<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orged246c5" class="outline-3">
<h3 id="orged246c5"><span class="section-number-3">1.4</span> Tangle and Eval All</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This serves as a convenience to reload everything in the project by
first tangling and then updating the environment.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>call-interactively #'org-babel-tangle<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>mapc <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">lambda</span> <span style="color: #b0b1a3;">(</span>file<span style="color: #b0b1a3;">)</span>
        <span style="color: #b0b1a3;">(</span>cider-load-file file<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>
      <span style="color: #93a8c6;">(</span>directory-files <span style="color: #98be65;">"src/"</span> t <span style="color: #98be65;">".*</span><span style="color: #ff6c6b; background-color: #4c3840; font-weight: bold;">\</span><span style="color: #98be65;">.clj$"</span> t<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcffc676" class="outline-2">
<h2 id="orgcffc676"><span class="section-number-2">2</span> Defining the Microservice</h2>
<div class="outline-text-2" id="text-2">
<p>
The micro service has been broken down into components which appear in
the order of greatest interest first.  The service itself is simply
the composition of these components as follows:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">ns</span> <span style="color: #61afef;">project-catalog.service</span><span style="color: #8c8c8c;">)</span>

&lt;&lt;server&gt;&gt;
</pre>
</div>
</div>
