project-catalogue.org
** Routes
This section will cover the routes which we're defining in our
service.

We have an =/about= which explains the purpose of the service, index
which just posts the =project-catalog= in it's entirety, a projects URL
which you can post to and get from for projects and creating a project
respectively and a get for a particular project which accepts the
project name in the URL.

Important things to note here are that Pedestal can chain interceptors
together, e.g. the =body-params= interceptor and the =add-project=
interceptor.  The first parses parameters and the second handles the
request (with parameters now parsed and useful).  A problem with
adopting that approach is that Pedestal can't figure out the
difference between the vector version and some of the other routes
(could never figure out which) in that it can't generate a unique name
for them.  What I ended up needing to do was add a =:route-name=
keyword with a keyword name following it for that route.

#+BEGIN_SRC clojure :noweb tangle :noweb-ref routes :results none
  <<token>>
  <<services>>

  (require '[io.pedestal.http.body-params :as body-params])

  (def routes #{["/"                       :get  [`token-check `home-page]]
                ["/projects"               :post [`token-check (body-params/body-params) `add-project]
                 :route-name :add-project]
                ["/projects-xml"           :post [`token-check (body-params/body-params) `add-project-by-xml]
                 :route-name :add-project-by-xml]
                ["/projects"               :get  [`token-check `get-projects]]
                ["/projects/:project-name" :get  [`token-check `get-project]]
                ["/about"                  :get  [`token-check `about-page]]
                ["/see-also"               :get  [`token-check `git-get]]})
#+END_SRC

** Getting Projects from Github
We're going to use the HTTP client wrapper (a Clojure wrapper of the
Java HTTP client library) to make the calls.

#+BEGIN_SRC clojure :noweb-ref http-client
  (require '[clj-http.client :as client]
           '[clojure.data.json :as json])

  (defn git-search
    [q]
    (let [ret (client/get (format "https://api.github.com/search/repositories?q=%s+language:clojure" q)
                          {:debug false
                           :content-type :json
                           :accept :json})]
      (json/read-str (ret :body))))
#+END_SRC

