project-catalogue.html

<div id="outline-container-orgd9a31df" class="outline-3">
<h3 id="orgd9a31df"><span class="section-number-3">2.1</span> Routes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This section will cover the routes which we're defining in our
service.
</p>

<p>
We have an <code>/about</code> which explains the purpose of the service, index
which just posts the <code>project-catalog</code> in it's entirety, a projects URL
which you can post to and get from for projects and creating a project
respectively and a get for a particular project which accepts the
project name in the URL.
</p>

<p>
Important things to note here are that Pedestal can chain interceptors
together, e.g. the <code>body-params</code> interceptor and the <code>add-project</code>
interceptor.  The first parses parameters and the second handles the
request (with parameters now parsed and useful).  A problem with
adopting that approach is that Pedestal can't figure out the
difference between the vector version and some of the other routes
(could never figure out which) in that it can't generate a unique name
for them.  What I ended up needing to do was add a <code>:route-name</code>
keyword with a keyword name following it for that route.
</p>

<div class="org-src-container">
<pre class="src src-clojure">&lt;&lt;token&gt;&gt;
&lt;&lt;services&gt;&gt;

<span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.http.body-params</span> <span style="color: #61afef; font-weight: bold;">:as</span> body-params<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">def</span> <span style="color: #61afef;">routes</span> #<span style="color: #93a8c6;">{</span><span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/"</span>                       <span style="color: #61afef; font-weight: bold;">:get</span>  <span style="color: #97b098;">[</span>`token-check `home-page<span style="color: #97b098;">]</span><span style="color: #b0b1a3;">]</span>
              <span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/projects"</span>               <span style="color: #61afef; font-weight: bold;">:post</span> <span style="color: #97b098;">[</span>`token-check <span style="color: #aebed8;">(</span><span style="color: #61afef;">body-params</span><span style="color: #abb2bf; background-color: #282c34;">/</span>body-params<span style="color: #aebed8;">)</span> `add-project<span style="color: #97b098;">]</span>
               <span style="color: #61afef; font-weight: bold;">:route-name</span> <span style="color: #61afef; font-weight: bold;">:add-project</span><span style="color: #b0b1a3;">]</span>
              <span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/projects-xml"</span>           <span style="color: #61afef; font-weight: bold;">:post</span> <span style="color: #97b098;">[</span>`token-check <span style="color: #aebed8;">(</span><span style="color: #61afef;">body-params</span><span style="color: #abb2bf; background-color: #282c34;">/</span>body-params<span style="color: #aebed8;">)</span> `add-project-by-xml<span style="color: #97b098;">]</span>
               <span style="color: #61afef; font-weight: bold;">:route-name</span> <span style="color: #61afef; font-weight: bold;">:add-project-by-xml</span><span style="color: #b0b1a3;">]</span>
              <span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/projects"</span>               <span style="color: #61afef; font-weight: bold;">:get</span>  <span style="color: #97b098;">[</span>`token-check `get-projects<span style="color: #97b098;">]</span><span style="color: #b0b1a3;">]</span>
              <span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/projects/:project-name"</span> <span style="color: #61afef; font-weight: bold;">:get</span>  <span style="color: #97b098;">[</span>`token-check `get-project<span style="color: #97b098;">]</span><span style="color: #b0b1a3;">]</span>
              <span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/about"</span>                  <span style="color: #61afef; font-weight: bold;">:get</span>  <span style="color: #97b098;">[</span>`token-check `about-page<span style="color: #97b098;">]</span><span style="color: #b0b1a3;">]</span>
              <span style="color: #b0b1a3;">[</span><span style="color: #98be65;">"/see-also"</span>               <span style="color: #61afef; font-weight: bold;">:get</span>  <span style="color: #97b098;">[</span>`token-check `git-get<span style="color: #97b098;">]</span><span style="color: #b0b1a3;">]</span><span style="color: #93a8c6;">}</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org172018a" class="outline-3">
<h3 id="org172018a"><span class="section-number-3">2.2</span> Getting Projects from Github</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We're going to use the HTTP client wrapper (a Clojure wrapper of the
Java HTTP client library) to make the calls.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">clj-http.client</span> <span style="color: #61afef; font-weight: bold;">:as</span> client<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">clojure.data.json</span> <span style="color: #61afef; font-weight: bold;">:as</span> json<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">git-search</span>
  <span style="color: #93a8c6;">[</span>q<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>ret <span style="color: #97b098;">(</span><span style="color: #61afef;">client</span><span style="color: #abb2bf; background-color: #282c34;">/</span>get <span style="color: #aebed8;">(</span>format <span style="color: #98be65;">"https://api.github.com/search/repositories?q=%s+language:clojure"</span> q<span style="color: #aebed8;">)</span>
                        <span style="color: #aebed8;">{</span><span style="color: #61afef; font-weight: bold;">:debug</span> <span style="color: #da8548; font-weight: bold;">false</span>
                         <span style="color: #61afef; font-weight: bold;">:content-type</span> <span style="color: #61afef; font-weight: bold;">:json</span>
                         <span style="color: #61afef; font-weight: bold;">:accept</span> <span style="color: #61afef; font-weight: bold;">:json</span><span style="color: #aebed8;">}</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #61afef;">json</span><span style="color: #abb2bf; background-color: #282c34;">/</span>read-str <span style="color: #97b098;">(</span>ret <span style="color: #61afef; font-weight: bold;">:body</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
