project-catalogue.org
** Services
Each route is routed to a service.  We define those services with a
single function which we define as follows:

#+BEGIN_SRC clojure :noweb tangle :noweb-ref services :results none
  <<get-project>>
  <<http-client>>

  (require '[io.pedestal.http :as http]
           '[io.pedestal.http.route :as route]
           '[ring.util.response :as ring-resp]
           '[monger.core :as mg]
           '[monger.credentials :as mcr]
           '[monger.collection :as mc]
           '[monger.json]
           '[clojure.data.xml :as xml])

  (defn about-page
    [request]
    (ring-resp/response (format "Clojure %s - served from %s"
                                (clojure-version)
                                (route/url-for ::about-page))))

  (defn home-page
    [request]
    (let [conn (mg/connect-with-credentials
                "ds161580.mlab.com:61580"
                (mcr/create "user"
                            "bucket"
                            "password"))
          db (mg/get-db conn "bucket")]
      (http/json-response
       (mc/find-maps db
                     "project-catalog"))))

  (def mock-project-collection {:sleeping-cat {:name "Sleeping Cat Project"
                                               :framework "Pedastal"
                                               :language "Clojure"
                                               :repo "https://gitlab.com/srehorn/sleepingcat"}
                                :stinkey-dog {:name "Stinky Dog Experiment"
                                              :framework "Grails"
                                              :language "Groovy"
                                              :repo "https://gitlab.com/srehorn/stinkydog"}})

  (defn git-get
    [request]
    (http/json-response
     (git-search (get-in request [:query-params :q]))))


  (defn get-projects
    [request]
    (http/json-response mock-project-collection))

  (defn get-project
    [request]
    (let [projname (get-in request [:path-params :project-name])]
      (http/json-response (db-get-project projname))))

  (defn add-project
    [request]
    (let [incoming (:json-params request)
          conn (mg/connect-with-credentials
                "ds161580.mlab.com:61580"
                (mcr/create "user"
                            "bucket"
                            "password"))
          db (mg/get-db conn "bucket")]
      (ring-resp/created "http://my-created-resource-url"
                         (mc/insert-and-return db "project-catalog" incoming))))

  <<xml>>

  (defn add-project-by-xml
    [request]
    (let [incoming (:json-params request)
          conn (mg/connect-with-credentials
                "ds161580.mlab.com:61580"
                (mcr/create "user"
                            "bucket"
                            "password"))
          db (mg/get-db conn "bucket")]
      (-> (ring-resp/created "http://my-created-resource-url"
                             (xml/emit-str (project-to-xml-str (mc/insert-and-return db "project-catalog" incoming))))
          (ring-resp/content-type "application/xml"))))
#+END_SRC

