project-catalogue.html

<div id="outline-container-org99520d9" class="outline-3">
<h3 id="org99520d9"><span class="section-number-3">2.3</span> Services</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Each route is routed to a service.  We define those services with a
single function which we define as follows:
</p>

<div class="org-src-container">
<pre class="src src-clojure">&lt;&lt;get-project&gt;&gt;
&lt;&lt;http-client&gt;&gt;

<span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.http</span> <span style="color: #61afef; font-weight: bold;">:as</span> http<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.http.route</span> <span style="color: #61afef; font-weight: bold;">:as</span> route<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">ring.util.response</span> <span style="color: #61afef; font-weight: bold;">:as</span> ring-resp<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.core</span> <span style="color: #61afef; font-weight: bold;">:as</span> mg<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.credentials</span> <span style="color: #61afef; font-weight: bold;">:as</span> mcr<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.collection</span> <span style="color: #61afef; font-weight: bold;">:as</span> mc<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.json</span><span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">clojure.data.xml</span> <span style="color: #61afef; font-weight: bold;">:as</span> xml<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">about-page</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #61afef;">ring-resp</span><span style="color: #abb2bf; background-color: #282c34;">/</span>response <span style="color: #b0b1a3;">(</span>format <span style="color: #98be65;">"Clojure %s - served from %s"</span>
                              <span style="color: #97b098;">(</span>clojure-version<span style="color: #97b098;">)</span>
                              <span style="color: #97b098;">(</span><span style="color: #61afef;">route</span><span style="color: #abb2bf; background-color: #282c34;">/</span>url-for <span style="color: #61afef; font-weight: bold;">::about-page</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">home-page</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>conn <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>connect-with-credentials
              <span style="color: #98be65;">"ds161580.mlab.com:61580"</span>
              <span style="color: #aebed8;">(</span><span style="color: #61afef;">mcr</span><span style="color: #abb2bf; background-color: #282c34;">/</span>create <span style="color: #98be65;">"user"</span>
                          <span style="color: #98be65;">"bucket"</span>
                          <span style="color: #98be65;">"password"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        db <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>get-db conn <span style="color: #98be65;">"bucket"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #61afef;">http</span><span style="color: #abb2bf; background-color: #282c34;">/</span>json-response
     <span style="color: #97b098;">(</span><span style="color: #61afef;">mc</span><span style="color: #abb2bf; background-color: #282c34;">/</span>find-maps db
                   <span style="color: #98be65;">"project-catalog"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">def</span> <span style="color: #61afef;">mock-project-collection</span> <span style="color: #93a8c6;">{</span><span style="color: #61afef; font-weight: bold;">:sleeping-cat</span> <span style="color: #b0b1a3;">{</span><span style="color: #61afef; font-weight: bold;">:name</span> <span style="color: #98be65;">"Sleeping Cat Project"</span>
                                             <span style="color: #61afef; font-weight: bold;">:framework</span> <span style="color: #98be65;">"Pedastal"</span>
                                             <span style="color: #61afef; font-weight: bold;">:language</span> <span style="color: #98be65;">"Clojure"</span>
                                             <span style="color: #61afef; font-weight: bold;">:repo</span> <span style="color: #98be65;">"https://gitlab.com/srehorn/sleepingcat"</span><span style="color: #b0b1a3;">}</span>
                              <span style="color: #61afef; font-weight: bold;">:stinkey-dog</span> <span style="color: #b0b1a3;">{</span><span style="color: #61afef; font-weight: bold;">:name</span> <span style="color: #98be65;">"Stinky Dog Experiment"</span>
                                            <span style="color: #61afef; font-weight: bold;">:framework</span> <span style="color: #98be65;">"Grails"</span>
                                            <span style="color: #61afef; font-weight: bold;">:language</span> <span style="color: #98be65;">"Groovy"</span>
                                            <span style="color: #61afef; font-weight: bold;">:repo</span> <span style="color: #98be65;">"https://gitlab.com/srehorn/stinkydog"</span><span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">}</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">git-get</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #61afef;">http</span><span style="color: #abb2bf; background-color: #282c34;">/</span>json-response
   <span style="color: #b0b1a3;">(</span>git-search <span style="color: #97b098;">(</span>get-in request <span style="color: #aebed8;">[</span><span style="color: #61afef; font-weight: bold;">:query-params</span> <span style="color: #61afef; font-weight: bold;">:q</span><span style="color: #aebed8;">]</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>


<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">get-projects</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #61afef;">http</span><span style="color: #abb2bf; background-color: #282c34;">/</span>json-response mock-project-collection<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">get-project</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>projname <span style="color: #97b098;">(</span>get-in request <span style="color: #aebed8;">[</span><span style="color: #61afef; font-weight: bold;">:path-params</span> <span style="color: #61afef; font-weight: bold;">:project-name</span><span style="color: #aebed8;">]</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #61afef;">http</span><span style="color: #abb2bf; background-color: #282c34;">/</span>json-response <span style="color: #97b098;">(</span>db-get-project projname<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">add-project</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>incoming <span style="color: #97b098;">(</span><span style="color: #61afef; font-weight: bold;">:json-params</span> request<span style="color: #97b098;">)</span>
        conn <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>connect-with-credentials
              <span style="color: #98be65;">"ds161580.mlab.com:61580"</span>
              <span style="color: #aebed8;">(</span><span style="color: #61afef;">mcr</span><span style="color: #abb2bf; background-color: #282c34;">/</span>create <span style="color: #98be65;">"user"</span>
                          <span style="color: #98be65;">"bucket"</span>
                          <span style="color: #98be65;">"password"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        db <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>get-db conn <span style="color: #98be65;">"bucket"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #61afef;">ring-resp</span><span style="color: #abb2bf; background-color: #282c34;">/</span>created <span style="color: #98be65;">"http://my-created-resource-url"</span>
                       <span style="color: #97b098;">(</span><span style="color: #61afef;">mc</span><span style="color: #abb2bf; background-color: #282c34;">/</span>insert-and-return db <span style="color: #98be65;">"project-catalog"</span> incoming<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

&lt;&lt;xml&gt;&gt;

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">add-project-by-xml</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>incoming <span style="color: #97b098;">(</span><span style="color: #61afef; font-weight: bold;">:json-params</span> request<span style="color: #97b098;">)</span>
        conn <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>connect-with-credentials
              <span style="color: #98be65;">"ds161580.mlab.com:61580"</span>
              <span style="color: #aebed8;">(</span><span style="color: #61afef;">mcr</span><span style="color: #abb2bf; background-color: #282c34;">/</span>create <span style="color: #98be65;">"user"</span>
                          <span style="color: #98be65;">"bucket"</span>
                          <span style="color: #98be65;">"password"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        db <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>get-db conn <span style="color: #98be65;">"bucket"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #c678dd; font-weight: bold;">-&gt;</span> <span style="color: #97b098;">(</span><span style="color: #61afef;">ring-resp</span><span style="color: #abb2bf; background-color: #282c34;">/</span>created <span style="color: #98be65;">"http://my-created-resource-url"</span>
                           <span style="color: #aebed8;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>emit-str <span style="color: #b0b0b3;">(</span>project-to-xml-str <span style="color: #90a890;">(</span><span style="color: #61afef;">mc</span><span style="color: #abb2bf; background-color: #282c34;">/</span>insert-and-return db <span style="color: #98be65;">"project-catalog"</span> incoming<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        <span style="color: #97b098;">(</span><span style="color: #61afef;">ring-resp</span><span style="color: #abb2bf; background-color: #282c34;">/</span>content-type <span style="color: #98be65;">"application/xml"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
