project-catalogue.org
** Database Queries
The first query which we need is one to get a project by it's name.

#+BEGIN_SRC clojure :noweb-ref get-project
  (require '[monger.core :as mg]
           '[monger.credentials :as mcr]
           '[monger.collection :as mc])

  (defn db-get-project
    [proj-name]
    (let [conn (mg/connect-with-credentials
                "ds161580.mlab.com:61580"
                (mcr/create "user"
                            "bucket"
                            "password"))
          db (mg/get-db conn "bucket")]
      (mc/find-maps db "project-catalog" {:proj-name proj-name})))
#+END_SRC

** Pedestal Service Definition
Pedestal requires a definition of the service as a whole which
includes everything that the server needs in order to start up a
server with the required stuff.

#+BEGIN_SRC clojure :noweb tangle :noweb-ref pedestal-service :results none
  <<routes>>

  (require '[io.pedestal.http :as http])

  (def service {:env :prod
                ::http/routes routes
                ::http/resource-path "/public"
                ::http/type :jetty
                ::http/port 8080
                ::http/container-options {:h2c? true
                                          :h2?  false
                                          :ssl? false}})
#+END_SRC

** Web Server
The definition of the server itself is as follows.

#+BEGIN_SRC clojure :noweb-ref server :results none
  <<pedestal-service>>

  (require '[io.pedestal.http       :as server]
           '[io.pedestal.http.route :as route])

  (defonce runnable-service (server/create-server service))

  (defn run-dev
    "Run the server persistently and in the background for development."
    [& args]
    (println "\nCreating your [DEV] server...")
    (-> service
        (merge {:env :dev
                ::server/join? false
                ::server/routes #(route/expand-routes (deref #'routes))
                ::server/allowed-origins {:creds true :allowed-origins (constantly true)}})
        server/default-interceptors
        server/dev-interceptors
        server/create-server
        server/start))
#+END_SRC

** Keeping It Safe
We need a form of defence against unwanted use of the micro service.
For this we're simply going to check that every request made to the
service contains a token in the headers which we're looking for.  If
it has the token then we may continue, otherwise we ought to tell them
that the action is not authorised.

#+BEGIN_SRC clojure :noweb-ref token
  (require '[io.pedestal.interceptor.helpers :as helpers]
           '[ring.util.response :as ring-resp])

  (helpers/defhandler token-check
    [request]
    (let [token (get-in request [:headers "x-catalog-token"])]
      (if (not (= token "o brave new world"))
        (assoc (ring-resp/response {:body "access denied"}) :status 403))))
#+END_SRC

