project-catalogue.html

<div id="outline-container-org544fd46" class="outline-3">
<h3 id="org544fd46"><span class="section-number-3">2.4</span> Database Queries</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The first query which we need is one to get a project by it's name.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.core</span> <span style="color: #61afef; font-weight: bold;">:as</span> mg<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.credentials</span> <span style="color: #61afef; font-weight: bold;">:as</span> mcr<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">monger.collection</span> <span style="color: #61afef; font-weight: bold;">:as</span> mc<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">db-get-project</span>
  <span style="color: #93a8c6;">[</span>proj-name<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>conn <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>connect-with-credentials
              <span style="color: #98be65;">"ds161580.mlab.com:61580"</span>
              <span style="color: #aebed8;">(</span><span style="color: #61afef;">mcr</span><span style="color: #abb2bf; background-color: #282c34;">/</span>create <span style="color: #98be65;">"user"</span>
                          <span style="color: #98be65;">"bucket"</span>
                          <span style="color: #98be65;">"password"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
        db <span style="color: #97b098;">(</span><span style="color: #61afef;">mg</span><span style="color: #abb2bf; background-color: #282c34;">/</span>get-db conn <span style="color: #98be65;">"bucket"</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #61afef;">mc</span><span style="color: #abb2bf; background-color: #282c34;">/</span>find-maps db <span style="color: #98be65;">"project-catalog"</span> <span style="color: #97b098;">{</span><span style="color: #61afef; font-weight: bold;">:proj-name</span> proj-name<span style="color: #97b098;">}</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd9bead" class="outline-3">
<h3 id="orgbd9bead"><span class="section-number-3">2.5</span> Pedestal Service Definition</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Pedestal requires a definition of the service as a whole which
includes everything that the server needs in order to start up a
server with the required stuff.
</p>

<div class="org-src-container">
<pre class="src src-clojure">&lt;&lt;routes&gt;&gt;

<span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.http</span> <span style="color: #61afef; font-weight: bold;">:as</span> http<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">def</span> <span style="color: #61afef;">service</span> <span style="color: #93a8c6;">{</span><span style="color: #61afef; font-weight: bold;">:env</span> <span style="color: #61afef; font-weight: bold;">:prod</span>
              <span style="color: #61afef; font-weight: bold;">::http/routes</span> routes
              <span style="color: #61afef; font-weight: bold;">::http/resource-path</span> <span style="color: #98be65;">"/public"</span>
              <span style="color: #61afef; font-weight: bold;">::http/type</span> <span style="color: #61afef; font-weight: bold;">:jetty</span>
              <span style="color: #61afef; font-weight: bold;">::http/port</span> 8080
              <span style="color: #61afef; font-weight: bold;">::http/container-options</span> <span style="color: #b0b1a3;">{</span><span style="color: #61afef; font-weight: bold;">:h2c?</span> <span style="color: #da8548; font-weight: bold;">true</span>
                                        <span style="color: #61afef; font-weight: bold;">:h2?</span>  <span style="color: #da8548; font-weight: bold;">false</span>
                                        <span style="color: #61afef; font-weight: bold;">:ssl?</span> <span style="color: #da8548; font-weight: bold;">false</span><span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">}</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7257b8" class="outline-3">
<h3 id="orgf7257b8"><span class="section-number-3">2.6</span> Web Server</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The definition of the server itself is as follows.
</p>

<div class="org-src-container">
<pre class="src src-clojure">&lt;&lt;pedestal-service&gt;&gt;

<span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.http</span>       <span style="color: #61afef; font-weight: bold;">:as</span> server<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.http.route</span> <span style="color: #61afef; font-weight: bold;">:as</span> route<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defonce</span> <span style="color: #61afef;">runnable-service</span> <span style="color: #93a8c6;">(</span><span style="color: #61afef;">server</span><span style="color: #abb2bf; background-color: #282c34;">/</span>create-server service<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">run-dev</span>
  <span style="color: #9eac8c;">"Run the server persistently and in the background for development."</span>
  <span style="color: #93a8c6;">[</span>&amp; args<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span>println <span style="color: #98be65;">"</span><span style="color: #98be65; font-weight: bold;">\n</span><span style="color: #98be65;">Creating your [DEV] server..."</span><span style="color: #93a8c6;">)</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">-&gt;</span> service
      <span style="color: #b0b1a3;">(</span>merge <span style="color: #97b098;">{</span><span style="color: #61afef; font-weight: bold;">:env</span> <span style="color: #61afef; font-weight: bold;">:dev</span>
              <span style="color: #61afef; font-weight: bold;">::server/join?</span> <span style="color: #da8548; font-weight: bold;">false</span>
              <span style="color: #61afef; font-weight: bold;">::server/routes</span> #<span style="color: #aebed8;">(</span><span style="color: #61afef;">route</span><span style="color: #abb2bf; background-color: #282c34;">/</span>expand-routes <span style="color: #b0b0b3;">(</span>deref #'routes<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
              <span style="color: #61afef; font-weight: bold;">::server/allowed-origins</span> <span style="color: #aebed8;">{</span><span style="color: #61afef; font-weight: bold;">:creds</span> <span style="color: #da8548; font-weight: bold;">true</span> <span style="color: #61afef; font-weight: bold;">:allowed-origins</span> <span style="color: #b0b0b3;">(</span>constantly <span style="color: #da8548; font-weight: bold;">true</span><span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">}</span><span style="color: #97b098;">}</span><span style="color: #b0b1a3;">)</span>
      <span style="color: #61afef;">server</span><span style="color: #abb2bf; background-color: #282c34;">/</span>default-interceptors
      <span style="color: #61afef;">server</span><span style="color: #abb2bf; background-color: #282c34;">/</span>dev-interceptors
      <span style="color: #61afef;">server</span><span style="color: #abb2bf; background-color: #282c34;">/</span>create-server
      <span style="color: #61afef;">server</span><span style="color: #abb2bf; background-color: #282c34;">/</span>start<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe3095b" class="outline-3">
<h3 id="orgfe3095b"><span class="section-number-3">2.7</span> Keeping It Safe</h3>
<div class="outline-text-3" id="text-2-7">
<p>
We need a form of defence against unwanted use of the micro service.
For this we're simply going to check that every request made to the
service contains a token in the headers which we're looking for.  If
it has the token then we may continue, otherwise we ought to tell them
that the action is not authorised.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">io.pedestal.interceptor.helpers</span> <span style="color: #61afef; font-weight: bold;">:as</span> helpers<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">ring.util.response</span> <span style="color: #61afef; font-weight: bold;">:as</span> ring-resp<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #61afef;">helpers</span><span style="color: #abb2bf; background-color: #282c34;">/</span><span style="color: #c678dd; font-weight: bold;">defhandler</span> <span style="color: #61afef;">token-check</span>
  <span style="color: #93a8c6;">[</span>request<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>token <span style="color: #97b098;">(</span>get-in request <span style="color: #aebed8;">[</span><span style="color: #61afef; font-weight: bold;">:headers</span> <span style="color: #98be65;">"x-catalog-token"</span><span style="color: #aebed8;">]</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #c678dd; font-weight: bold;">if</span> <span style="color: #97b098;">(</span>not <span style="color: #aebed8;">(</span>= token <span style="color: #98be65;">"o brave new world"</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
      <span style="color: #97b098;">(</span>assoc <span style="color: #aebed8;">(</span><span style="color: #61afef;">ring-resp</span><span style="color: #abb2bf; background-color: #282c34;">/</span>response <span style="color: #b0b0b3;">{</span><span style="color: #61afef; font-weight: bold;">:body</span> <span style="color: #98be65;">"access denied"</span><span style="color: #b0b0b3;">}</span><span style="color: #aebed8;">)</span> <span style="color: #61afef; font-weight: bold;">:status</span> 403<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
