project-catalogue.org
** Post to a Token Service
Sometimes we might want to call another service.  In this example
we're going to pretend to be calling a token auth. service.  This is
mostly for demonstration, but if you have a real service then you can
quite easily see how it's done.

This is the example given in the course which I was doing, but
predictably along with everything else in the course it was out of
date and didn't exist anymore.  It looked like a temporary thing
anyway so I don't knew whether the instructor intended for his
students to call the service.

#+BEGIN_SRC clojure :noweb-ref authenticate :results none
  (require '[clj-http.client :as client]
           '[clojure.data.json :as json])

  (defn auth0-token
    []
    (let [ret (client/post "https://jemez.auth0.com/oath/token"
                           {:debug false
                            :content-type :json
                            :form-params {:client_id "AUTH_CLIENT_ID"
                                          :client_secret "AUTH_SECRET"
                                          :grant_type "client_credentials"}})]
      (json/read-str (ret :body))))
#+END_SRC

He goes on to show an example of how you would call an authenticated
API using the token you get from the above method.

#+BEGIN_SRC clojure :results none
  <<authenticate>>

  (defn auth0-connections
    [tok]
    (let [ret (client/get "https://jemez.auth0.com/api/connections"
                          {:debug false
                           :content-type :json
                           :accept :json
                           :headers {"Authorization" (format "Bearer %s" tok)}})]
      (ret :body)))
#+END_SRC

