project-catalogue.html

<div id="outline-container-orgaa310ca" class="outline-3">
<h3 id="orgaa310ca"><span class="section-number-3">2.8</span> Post to a Token Service</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Sometimes we might want to call another service.  In this example
we're going to pretend to be calling a token auth. service.  This is
mostly for demonstration, but if you have a real service then you can
quite easily see how it's done.
</p>

<p>
This is the example given in the course which I was doing, but
predictably along with everything else in the course it was out of
date and didn't exist anymore.  It looked like a temporary thing
anyway so I don't knew whether the instructor intended for his
students to call the service.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">clj-http.client</span> <span style="color: #61afef; font-weight: bold;">:as</span> client<span style="color: #93a8c6;">]</span>
         '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">clojure.data.json</span> <span style="color: #61afef; font-weight: bold;">:as</span> json<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">auth0-token</span>
  <span style="color: #93a8c6;">[]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>ret <span style="color: #97b098;">(</span><span style="color: #61afef;">client</span><span style="color: #abb2bf; background-color: #282c34;">/</span>post <span style="color: #98be65;">"https://jemez.auth0.com/oath/token"</span>
                         <span style="color: #aebed8;">{</span><span style="color: #61afef; font-weight: bold;">:debug</span> <span style="color: #da8548; font-weight: bold;">false</span>
                          <span style="color: #61afef; font-weight: bold;">:content-type</span> <span style="color: #61afef; font-weight: bold;">:json</span>
                          <span style="color: #61afef; font-weight: bold;">:form-params</span> <span style="color: #b0b0b3;">{</span><span style="color: #61afef; font-weight: bold;">:client_id</span> <span style="color: #98be65;">"AUTH_CLIENT_ID"</span>
                                        <span style="color: #61afef; font-weight: bold;">:client_secret</span> <span style="color: #98be65;">"AUTH_SECRET"</span>
                                        <span style="color: #61afef; font-weight: bold;">:grant_type</span> <span style="color: #98be65;">"client_credentials"</span><span style="color: #b0b0b3;">}</span><span style="color: #aebed8;">}</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span><span style="color: #61afef;">json</span><span style="color: #abb2bf; background-color: #282c34;">/</span>read-str <span style="color: #97b098;">(</span>ret <span style="color: #61afef; font-weight: bold;">:body</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
He goes on to show an example of how you would call an authenticated
API using the token you get from the above method.
</p>

<div class="org-src-container">
<pre class="src src-clojure">&lt;&lt;authenticate&gt;&gt;

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">auth0-connections</span>
  <span style="color: #93a8c6;">[</span>tok<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>ret <span style="color: #97b098;">(</span><span style="color: #61afef;">client</span><span style="color: #abb2bf; background-color: #282c34;">/</span>get <span style="color: #98be65;">"https://jemez.auth0.com/api/connections"</span>
                        <span style="color: #aebed8;">{</span><span style="color: #61afef; font-weight: bold;">:debug</span> <span style="color: #da8548; font-weight: bold;">false</span>
                         <span style="color: #61afef; font-weight: bold;">:content-type</span> <span style="color: #61afef; font-weight: bold;">:json</span>
                         <span style="color: #61afef; font-weight: bold;">:accept</span> <span style="color: #61afef; font-weight: bold;">:json</span>
                         <span style="color: #61afef; font-weight: bold;">:headers</span> <span style="color: #b0b0b3;">{</span><span style="color: #98be65;">"Authorization"</span> <span style="color: #90a890;">(</span>format <span style="color: #98be65;">"Bearer %s"</span> tok<span style="color: #90a890;">)</span><span style="color: #b0b0b3;">}</span><span style="color: #aebed8;">}</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">(</span>ret <span style="color: #61afef; font-weight: bold;">:body</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
