project-catalogue.org
** Handling XML
Rest doesn't mandate the serialisation standard to be used when
communicating between the client and the server.  Even so JSON is by
far the most popular and is often confused by those less experienced
as being RESTFUL.  XML may also be used as a serialisation standard.

Here we'll demo how that can be done.

#+BEGIN_SRC clojure :noweb-ref xml :results none
  (require '[clojure.data.xml :as xml])

  (def raw-proj-string "<project>
    <proj-name>olingquit</proj-name>
    <name>The Important Olingquit Project</name>
    <framework>Rails</framework>
    <language>Ruby</language>
    <repo>https://gitlab.com/srehorn/olingquit</repo>
    </project>")

  (def proj-xml (xml/parse-str raw-proj-string))

  (defn get-by-tag
    [proj-map tag]
    (->> proj-map
         :content
         (filter #(= (:tag %) tag))
         first
         :content
         first))

  (defn xml-str-to-project
    [xml-string]
    (let [xml (xml/parse-str xml-string)]
      {:proj-name (get-by-tag xml :proj-name)
       :name      (get-by-tag xml :name)
       :framework (get-by-tag xml :framework)
       :language  (get-by-tag xml :language)
       :repo      (get-by-tag xml :repo)}))

  (defn project-to-xml-str
    [project]
    ((xml/element :project {}
                  (xml/element :_id       {} (.toString (:_id       project)))
                  (xml/element :proj-name {} (.toString (:proj-name project)))
                  (xml/element :name      {} (.toString (:name      project)))
                  (xml/element :framework {} (.toString (:framework project)))
                  (xml/element :repo      {} (.toString (:repo      project)))
                  (xml/element :language  {} (.toString (:language  project))))))
#+END_SRC

* Testing the Service
This section serves to list some simple requests which you can make to
the service.

** Get Projects
You can list all of the projects in the database with a get on
=/Projects=.

#+BEGIN_SRC http :pretty :results code :exports both
  GET http://localhost:8080/projects
  x-catalog-token: o brave new world
#+END_SRC

#+RESULTS:
#+BEGIN_SRC http
{
  "sleeping-cat": {
    "name": "Sleeping Cat Project",
    "framework": "Pedastal",
    "language": "Clojure",
    "repo": "https://gitlab.com/srehorn/sleepingcat"
  },
  "stinkey-dog": {
    "name": "Stinky Dog Experiment",
    "framework": "Grails",
    "language": "Groovy",
    "repo": "https://gitlab.com/srehorn/stinkydog"
  }
}
#+END_SRC

** Get a Project By Name
You can get any project by it's name.

#+BEGIN_SRC http :pretty :results code :exports both
  GET http://localhost:8080/projects/staggering-echidna
  x-catalog-token: o brave new world
#+END_SRC

