project-catalogue.html

<div id="outline-container-org2b51390" class="outline-3">
<h3 id="org2b51390"><span class="section-number-3">2.9</span> Handling XML</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Rest doesn't mandate the serialisation standard to be used when
communicating between the client and the server.  Even so JSON is by
far the most popular and is often confused by those less experienced
as being RESTFUL.  XML may also be used as a serialisation standard.
</p>

<p>
Here we'll demo how that can be done.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>require '<span style="color: #93a8c6;">[</span><span style="color: #61afef;">clojure.data.xml</span> <span style="color: #61afef; font-weight: bold;">:as</span> xml<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">def</span> <span style="color: #61afef;">raw-proj-string</span> <span style="color: #9eac8c;">"&lt;project&gt;</span>
<span style="color: #9eac8c;">  &lt;proj-name&gt;olingquit&lt;/proj-name&gt;</span>
<span style="color: #9eac8c;">  &lt;name&gt;The Important Olingquit Project&lt;/name&gt;</span>
<span style="color: #9eac8c;">  &lt;framework&gt;Rails&lt;/framework&gt;</span>
<span style="color: #9eac8c;">  &lt;language&gt;Ruby&lt;/language&gt;</span>
<span style="color: #9eac8c;">  &lt;repo&gt;https://gitlab.com/srehorn/olingquit&lt;/repo&gt;</span>
<span style="color: #9eac8c;">  &lt;/project&gt;"</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">def</span> <span style="color: #61afef;">proj-xml</span> <span style="color: #93a8c6;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>parse-str raw-proj-string<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">get-by-tag</span>
  <span style="color: #93a8c6;">[</span>proj-map tag<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">-&gt;&gt;</span> proj-map
       <span style="color: #61afef; font-weight: bold;">:content</span>
       <span style="color: #b0b1a3;">(</span>filter #<span style="color: #97b098;">(</span>= <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">:tag</span> <span style="color: #61afef;">%</span><span style="color: #aebed8;">)</span> tag<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>
       first
       <span style="color: #61afef; font-weight: bold;">:content</span>
       first<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">xml-str-to-project</span>
  <span style="color: #93a8c6;">[</span>xml-string<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #b0b1a3;">[</span>xml <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>parse-str xml-string<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">]</span>
    <span style="color: #b0b1a3;">{</span><span style="color: #61afef; font-weight: bold;">:proj-name</span> <span style="color: #97b098;">(</span>get-by-tag xml <span style="color: #61afef; font-weight: bold;">:proj-name</span><span style="color: #97b098;">)</span>
     <span style="color: #61afef; font-weight: bold;">:name</span>      <span style="color: #97b098;">(</span>get-by-tag xml <span style="color: #61afef; font-weight: bold;">:name</span><span style="color: #97b098;">)</span>
     <span style="color: #61afef; font-weight: bold;">:framework</span> <span style="color: #97b098;">(</span>get-by-tag xml <span style="color: #61afef; font-weight: bold;">:framework</span><span style="color: #97b098;">)</span>
     <span style="color: #61afef; font-weight: bold;">:language</span>  <span style="color: #97b098;">(</span>get-by-tag xml <span style="color: #61afef; font-weight: bold;">:language</span><span style="color: #97b098;">)</span>
     <span style="color: #61afef; font-weight: bold;">:repo</span>      <span style="color: #97b098;">(</span>get-by-tag xml <span style="color: #61afef; font-weight: bold;">:repo</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">defn</span> <span style="color: #61afef;">project-to-xml-str</span>
  <span style="color: #93a8c6;">[</span>project<span style="color: #93a8c6;">]</span>
  <span style="color: #93a8c6;">(</span><span style="color: #b0b1a3;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:project</span> <span style="color: #97b098;">{}</span>
                <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:_id</span>       <span style="color: #aebed8;">{}</span> <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">.toString</span> <span style="color: #b0b0b3;">(</span><span style="color: #61afef; font-weight: bold;">:_id</span>       project<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
                <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:proj-name</span> <span style="color: #aebed8;">{}</span> <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">.toString</span> <span style="color: #b0b0b3;">(</span><span style="color: #61afef; font-weight: bold;">:proj-name</span> project<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
                <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:name</span>      <span style="color: #aebed8;">{}</span> <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">.toString</span> <span style="color: #b0b0b3;">(</span><span style="color: #61afef; font-weight: bold;">:name</span>      project<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
                <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:framework</span> <span style="color: #aebed8;">{}</span> <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">.toString</span> <span style="color: #b0b0b3;">(</span><span style="color: #61afef; font-weight: bold;">:framework</span> project<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
                <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:repo</span>      <span style="color: #aebed8;">{}</span> <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">.toString</span> <span style="color: #b0b0b3;">(</span><span style="color: #61afef; font-weight: bold;">:repo</span>      project<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span>
                <span style="color: #97b098;">(</span><span style="color: #61afef;">xml</span><span style="color: #abb2bf; background-color: #282c34;">/</span>element <span style="color: #61afef; font-weight: bold;">:language</span>  <span style="color: #aebed8;">{}</span> <span style="color: #aebed8;">(</span><span style="color: #61afef; font-weight: bold;">.toString</span> <span style="color: #b0b0b3;">(</span><span style="color: #61afef; font-weight: bold;">:language</span>  project<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a6868c" class="outline-2">
<h2 id="org0a6868c"><span class="section-number-2">3</span> Testing the Service</h2>
<div class="outline-text-2" id="text-3">
<p>
This section serves to list some simple requests which you can make to
the service.
</p>
</div>

<div id="outline-container-orga4261d3" class="outline-3">
<h3 id="orga4261d3"><span class="section-number-3">3.1</span> Get Projects</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You can list all of the projects in the database with a get on
<code>/Projects</code>.
</p>

<div class="org-src-container">
<pre class="src src-http"><span style="color: #da8548; font-weight: bold;">GET</span> <span style="color: #61afef;">http://localhost:8080/projects</span>
x-catalog-token<span style="color: #687080; font-style: italic;">:</span> o brave new world
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7fa859" class="outline-3">
<h3 id="orgb7fa859"><span class="section-number-3">3.2</span> Get a Project By Name</h3>
<div class="outline-text-3" id="text-3-2">
<p>
You can get any project by it's name.
</p>

<div class="org-src-container">
<pre class="src src-http"><span style="color: #da8548; font-weight: bold;">GET</span> <span style="color: #61afef;">http://localhost:8080/projects/staggering-echidna</span>
x-catalog-token<span style="color: #687080; font-style: italic;">:</span> o brave new world
</pre>
</div>
</div>
</div>
