project-catalogue.org
** Creating a Project
The following will create a project with the name
"staggering-echidna".  Initially I had a problem with this because I
had removed the interceptor in the chain of interceptors for posting
which actually parsed the body content.

#+BEGIN_SRC http :pretty :results code :exports both
  POST http://localhost:8080/projects
  Content-Type: application/json
  x-catalog-token: o brave new world

  {"name": "Staggering Echidna",
   "framework": "Pedastal",
   "language": "Clojure",
   "repo": "http://gitlab.com/srehorn/staggering-echidna",
   "proj-name": "staggering-echidna"}
#+END_SRC

#+RESULTS:
#+BEGIN_SRC http
{:_id #object[org.bson.types.ObjectId 0x4f49af65 "58f3a5072ecf106846cce3a1"], :name "Staggering Echidna", :framework "Pedastal", :language "Clojure", :repo "http://gitlab.com/srehorn/staggering-echidna", :proj-name "staggering-echidna"}
#+END_SRC

You can also create a project by XML.  Although this isn't working
right now.  The response to this one is a bit too big so we'll exclude
it from the weaved document.

#+BEGIN_SRC http :pretty :results code
  POST http://localhost:8080/projects-xml
  Content-Type: application/xml
  x-catalog-token: o brave new world

  <project>
    <proj-name>olingquit</proj-name>
    <name>The Important Olingquit Project</name>
    <framework>Rails</framework>
    <language>Ruby</language>
    <repo>https://gitlab.com/srehorn/olingquit</repo>
  </project>
#+END_SRC

#+RESULTS:
#+BEGIN_SRC http
Error processing request!
Exception:

clojure.lang.ExceptionInfo: Interceptor Exception: 
 at clojure.core$ex_info.invokeStatic (core.clj:4617)
    clojure.core$ex_info.invoke (core.clj:4617)
    io.pedestal.interceptor.chain$throwable__GT_ex_info.invokeStatic (chain.clj:33)
    io.pedestal.interceptor.chain$throwable__GT_ex_info.invoke (chain.clj:32)
    io.pedestal.interceptor.chain$try_f.invokeStatic (chain.clj:55)
    io.pedestal.interceptor.chain$try_f.invoke (chain.clj:42)
    io.pedestal.interceptor.chain$process_all_with_binding.invokeStatic (chain.clj:169)
    io.pedestal.interceptor.chain$process_all_with_binding.invoke (chain.clj:144)
    io.pedestal.interceptor.chain$process_all$fn__22637.invoke (chain.clj:186)
    clojure.lang.AFn.applyToHelper (AFn.java:152)
    clojure.lang.AFn.applyTo (AFn.java:144)
    clojure.core$apply.invokeStatic (core.clj:646)
    clojure.core$with_bindings_STAR_.invokeStatic (core.clj:1881)
    clojure.core$with_bindings_STAR_.doInvoke (core.clj:1881)
    clojure.lang.RestFn.invoke (RestFn.java:425)
    io.pedestal.interceptor.chain$process_all.invokeStatic (chain.clj:184)
    io.pedestal.interceptor.chain$process_all.invoke (chain.clj:180)
    io.pedestal.interceptor.chain$enter_all.invokeStatic (chain.clj:233)
    io.pedestal.interceptor.chain$enter_all.invoke (chain.clj:227)
    io.pedestal.interceptor.chain$execute.invokeStatic (chain.clj:377)
    io.pedestal.interceptor.chain$execute.invoke (chain.clj:350)
    io.pedestal.interceptor.chain$execute.invokeStatic (chain.clj:387)
    io.pedestal.interceptor.chain$execute.invoke (chain.clj:350)
    io.pedestal.http.impl.servlet_interceptor$interceptor_service_fn$fn__26291.invoke (servlet_interceptor.clj:350)
    io.pedestal.http.servlet.FnServlet.service (servlet.clj:28)
    org.eclipse.jetty.servlet.ServletHolder.handle (ServletHolder.java:838)
    org.eclipse.jetty.servlet.ServletHandler.doHandle (ServletHandler.java:543)
    org.eclipse.jetty.server.handler.ScopedHandler.nextHandle (ScopedHandler.java:188)
    org.eclipse.jetty.server.handler.ContextHandler.doHandle (ContextHandler.java:1228)
    org.eclipse.jetty.server.handler.ScopedHandler.nextScope (ScopedHandler.java:168)
    org.eclipse.jetty.servlet.ServletHandler.doScope (ServletHandler.java:481)
    org.eclipse.jetty.server.handler.ScopedHandler.nextScope (ScopedHandler.java:166)
    org.eclipse.jetty.server.handler.ContextHandler.doScope (ContextHandler.java:1130)
    org.eclipse.jetty.server.handler.ScopedHandler.handle (ScopedHandler.java:141)
    org.eclipse.jetty.server.handler.HandlerWrapper.handle (HandlerWrapper.java:132)
    org.eclipse.jetty.server.Server.handle (Server.java:564)
    org.eclipse.jetty.server.HttpChannel.handle (HttpChannel.java:318)
    org.eclipse.jetty.server.HttpConnection.onFillable (HttpConnection.java:251)
    org.eclipse.jetty.io.AbstractConnection$ReadCallback.succeeded (AbstractConnection.java:279)
    org.eclipse.jetty.io.FillInterest.fillable (FillInterest.java:112)
    org.eclipse.jetty.io.ChannelEndPoint$2.run (ChannelEndPoint.java:124)
    org.eclipse.jetty.util.thread.Invocable.invokePreferred (Invocable.java:122)
    org.eclipse.jetty.util.thread.strategy.ExecutingExecutionStrategy.invoke (ExecutingExecutionStrategy.java:58)
    org.eclipse.jetty.util.thread.strategy.ExecuteProduceConsume.produceConsume (ExecuteProduceConsume.java:201)
    org.eclipse.jetty.util.thread.strategy.ExecuteProduceConsume.run (ExecuteProduceConsume.java:133)
    org.eclipse.jetty.util.thread.QueuedThreadPool.runJob (QueuedThreadPool.java:672)
    org.eclipse.jetty.util.thread.QueuedThreadPool$2.run (QueuedThreadPool.java:590)
    java.lang.Thread.run (Thread.java:745)
Caused by: java.lang.NullPointerException: null
 at clojure.lang.Reflector.invokeNoArgInstanceMember (Reflector.java:301)
    project_catalog.service$project_to_xml_str.invokeStatic (form-init1647099764997980408.clj:130)
    project_catalog.service$project_to_xml_str.invoke (form-init1647099764997980408.clj:126)
    project_catalog.service$add_project_by_xml.invokeStatic (form-init1647099764997980408.clj:146)
    project_catalog.service$add_project_by_xml.invoke (form-init1647099764997980408.clj:136)
    io.pedestal.interceptor$eval15369$fn__15370$fn__15371.invoke (interceptor.clj:41)
    io.pedestal.interceptor.chain$try_f.invokeStatic (chain.clj:52)
    io.pedestal.interceptor.chain$try_f.invoke (chain.clj:42)
    io.pedestal.interceptor.chain$process_all_with_binding.invokeStatic (chain.clj:169)
    io.pedestal.interceptor.chain$process_all_with_binding.invoke (chain.clj:144)
    io.pedestal.interceptor.chain$process_all$fn__22637.invoke (chain.clj:186)
    clojure.lang.AFn.applyToHelper (AFn.java:152)
    clojure.lang.AFn.applyTo (AFn.java:144)
    clojure.core$apply.invokeStatic (core.clj:646)
    clojure.core$with_bindings_STAR_.invokeStatic (core.clj:1881)
    clojure.core$with_bindings_STAR_.doInvoke (core.clj:1881)
    clojure.lang.RestFn.invoke (RestFn.java:425)
    io.pedestal.interceptor.chain$process_all.invokeStatic (chain.clj:184)
    io.pedestal.interceptor.chain$process_all.invoke (chain.clj:180)
    io.pedestal.interceptor.chain$enter_all.invokeStatic (chain.clj:233)
    io.pedestal.interceptor.chain$enter_all.invoke (chain.clj:227)
    io.pedestal.interceptor.chain$execute.invokeStatic (chain.clj:377)
    io.pedestal.interceptor.chain$execute.invoke (chain.clj:350)
    io.pedestal.interceptor.chain$execute.invokeStatic (chain.clj:387)
    io.pedestal.interceptor.chain$execute.invoke (chain.clj:350)
    io.pedestal.http.impl.servlet_interceptor$interceptor_service_fn$fn__26291.invoke (servlet_interceptor.clj:350)
    io.pedestal.http.servlet.FnServlet.service (servlet.clj:28)
    org.eclipse.jetty.servlet.ServletHolder.handle (ServletHolder.java:838)
    org.eclipse.jetty.servlet.ServletHandler.doHandle (ServletHandler.java:543)
    org.eclipse.jetty.server.handler.ScopedHandler.nextHandle (ScopedHandler.java:188)
    org.eclipse.jetty.server.handler.ContextHandler.doHandle (ContextHandler.java:1228)
    org.eclipse.jetty.server.handler.ScopedHandler.nextScope (ScopedHandler.java:168)
    org.eclipse.jetty.servlet.ServletHandler.doScope (ServletHandler.java:481)
    org.eclipse.jetty.server.handler.ScopedHandler.nextScope (ScopedHandler.java:166)
    org.eclipse.jetty.server.handler.ContextHandler.doScope (ContextHandler.java:1130)
    org.eclipse.jetty.server.handler.ScopedHandler.handle (ScopedHandler.java:141)
    org.eclipse.jetty.server.handler.HandlerWrapper.handle (HandlerWrapper.java:132)
    org.eclipse.jetty.server.Server.handle (Server.java:564)
    org.eclipse.jetty.server.HttpChannel.handle (HttpChannel.java:318)
    org.eclipse.jetty.server.HttpConnection.onFillable (HttpConnection.java:251)
    org.eclipse.jetty.io.AbstractConnection$ReadCallback.succeeded (AbstractConnection.java:279)
    org.eclipse.jetty.io.FillInterest.fillable (FillInterest.java:112)
    org.eclipse.jetty.io.ChannelEndPoint$2.run (ChannelEndPoint.java:124)
    org.eclipse.jetty.util.thread.Invocable.invokePreferred (Invocable.java:122)
    org.eclipse.jetty.util.thread.strategy.ExecutingExecutionStrategy.invoke (ExecutingExecutionStrategy.java:58)
    org.eclipse.jetty.util.thread.strategy.ExecuteProduceConsume.produceConsume (ExecuteProduceConsume.java:201)
    org.eclipse.jetty.util.thread.strategy.ExecuteProduceConsume.run (ExecuteProduceConsume.java:133)
    org.eclipse.jetty.util.thread.QueuedThreadPool.runJob (QueuedThreadPool.java:672)
    org.eclipse.jetty.util.thread.QueuedThreadPool$2.run (QueuedThreadPool.java:590)
    java.lang.Thread.run (Thread.java:745)

Context:

{:response nil,
 :cors-headers
 {"Access-Control-Allow-Origin" "",
  "Access-Control-Allow-Credentials" "true"},
 :io.pedestal.interceptor.chain/stack
 ({:name :io.pedestal.http.impl.servlet-interceptor/ring-response,
   :enter nil,
   :leave
   #function[io.pedestal.http.impl.servlet-interceptor/leave-ring-response],
   :error
   #function[io.pedestal.http.impl.servlet-interceptor/error-ring-response]}
  {:name :io.pedestal.http.impl.servlet-interceptor/stylobate,
   :enter
   #function[io.pedestal.http.impl.servlet-interceptor/enter-stylobate],
   :leave
   #function[io.pedestal.http.impl.servlet-interceptor/leave-stylobate],
   :error
   #function[io.pedestal.http.impl.servlet-interceptor/error-stylobate]}
  {:name
   :io.pedestal.http.impl.servlet-interceptor/terminator-injector,
   :enter #function[io.pedestal.interceptor.helpers/before/fn--22828],
   :leave nil,
   :error nil}),
 :request
 {:protocol "HTTP/1.1",
  :async-supported? true,
  :remote-addr "127.0.0.1",
  :servlet-response
  #object[org.eclipse.jetty.server.Response 0x6f6060ab "HTTP/1.1 200 \nDate: Tue, 18 Apr 2017 18:39:05 GMT\r\n\r\n"],
  :servlet
  #object[io.pedestal.http.servlet.FnServlet 0x434f50ff "io.pedestal.http.servlet.FnServlet@434f50ff"],
  :headers
  {"user-agent" "curl/7.49.1",
   "host" "localhost:8080",
   "x-catalog-token" "o brave new world",
   "accept" "*/*",
   "content-length" "207",
   "content-type" "application/xml",
   "origin" ""},
  :server-port 8080,
  :servlet-request
  #object[org.eclipse.jetty.server.Request 0x2d6d8aa6 "Request(POST //localhost:8080/projects-xml)@2d6d8aa6"],
  :content-length 207,
  :content-type "application/xml",
  :path-info "/projects-xml",
  :url-for #function[io.pedestal.http.route/url-for-routes/fn--23560],
  :uri "/projects-xml",
  :server-name "localhost",
  :query-string nil,
  :path-params {},
  :body
  #object[org.eclipse.jetty.server.HttpInputOverHTTP 0x6318359b "HttpInputOverHTTP@6318359b[c=0,q=0,[0]=null,s=STREAM]"],
  :scheme :http,
  :request-method :post},
 :bindings
 {#'io.pedestal.http.route/*url-for*
  #function[io.pedestal.http.route/url-for-routes/fn--23560]},
 :enter-async
 [#function[io.pedestal.http.impl.servlet-interceptor/start-servlet-async]],
 :io.pedestal.interceptor.chain/terminators
 (#function[io.pedestal.http.impl.servlet-interceptor/terminator-inject/fn--26266]),
 :servlet-response
 #object[org.eclipse.jetty.server.Response 0x6f6060ab "HTTP/1.1 200 \nDate: Tue, 18 Apr 2017 18:39:05 GMT\r\n\r\n"],
 :route
 {:path "/projects-xml",
  :method :post,
  :path-re #"/\Qprojects-xml\E",
  :path-parts ["projects-xml"],
  :interceptors
  [{:name :project-catalog.service/token-check,
    :enter #function[io.pedestal.interceptor.helpers/before/fn--22828],
    :leave nil,
    :error nil}
   {:name :io.pedestal.http.body-params/body-params,
    :enter
    #function[io.pedestal.interceptor.helpers/on-request/fn--22870],
    :leave nil,
    :error nil}
   {:name nil,
    :enter
    #function[io.pedestal.interceptor/eval15369/fn--15370/fn--15371],
    :leave nil,
    :error nil}],
  :route-name :add-project-by-xml,
  :path-params {},
  :io.pedestal.http.route.prefix-tree/satisfies-constraints?
  #function[clojure.core/constantly/fn--4614]},
 :servlet
 #object[io.pedestal.http.servlet.FnServlet 0x434f50ff "io.pedestal.http.servlet.FnServlet@434f50ff"],
 :servlet-request
 #object[org.eclipse.jetty.server.Request 0x2d6d8aa6 "Request(POST //localhost:8080/projects-xml)@2d6d8aa6"],
 :url-for #function[io.pedestal.http.route/url-for-routes/fn--23560],
 :io.pedestal.interceptor.chain/execution-id 5,
 :servlet-config
 #object[org.eclipse.jetty.servlet.ServletHolder$Config 0x2c804d4f "org.eclipse.jetty.servlet.ServletHolder$Config@2c804d4f"],
 :async?
 #function[io.pedestal.http.impl.servlet-interceptor/servlet-async?]}
#+END_SRC

