project-catalogue.html

<div id="outline-container-org4c60880" class="outline-3">
<h3 id="org4c60880"><span class="section-number-3">3.3</span> Creating a Project</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The following will create a project with the name
"staggering-echidna".  Initially I had a problem with this because I
had removed the interceptor in the chain of interceptors for posting
which actually parsed the body content.
</p>

<div class="org-src-container">
<pre class="src src-http"><span style="color: #da8548; font-weight: bold;">POST</span> <span style="color: #61afef;">http://localhost:8080/projects</span>
<span style="color: #61afef;">Content-Type</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">application/json</span>
x-catalog-token<span style="color: #687080; font-style: italic;">:</span> o brave new world

<span style="color: #687080; font-style: italic;">{</span><span style="color: #98be65;">"name"</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">"Staggering Echidna"</span><span style="color: #687080; font-style: italic;">,</span>
 <span style="color: #98be65;">"framework"</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">"Pedastal"</span><span style="color: #687080; font-style: italic;">,</span>
 <span style="color: #98be65;">"language"</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">"Clojure"</span><span style="color: #687080; font-style: italic;">,</span>
 <span style="color: #98be65;">"repo"</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">"http://gitlab.com/srehorn/staggering-echidna"</span><span style="color: #687080; font-style: italic;">,</span>
 <span style="color: #98be65;">"proj-name"</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">"staggering-echidna"</span><span style="color: #687080; font-style: italic;">}</span>
</pre>
</div>

<p>
You can also create a project by XML.  Although this isn't working
right now.
</p>

<div class="org-src-container">
<pre class="src src-http"><span style="color: #da8548; font-weight: bold;">POST</span> <span style="color: #61afef;">http://localhost:8080/projects-xml</span>
<span style="color: #61afef;">Content-Type</span><span style="color: #687080; font-style: italic;">:</span> <span style="color: #98be65;">application/xml</span>
x-catalog-token<span style="color: #687080; font-style: italic;">:</span> o brave new world

&lt;project&gt;
  &lt;proj-name&gt;olingquit&lt;/proj-name&gt;
  &lt;name&gt;The Important Olingquit Project&lt;/name&gt;
  &lt;framework&gt;Rails&lt;/framework&gt;
  &lt;language&gt;Ruby&lt;/language&gt;
  &lt;repo&gt;https<span style="color: #687080; font-style: italic;">:</span>//gitlab.com/srehorn/olingquit&lt;/repo&gt;
&lt;/project&gt;
</pre>
</div>
</div>
</div>
